<!--
 * @Author: Kuntey
 * @Date: 2022-03-28 14:58:28
 * @LastEditors: Kuntey
 * @LastEditTime: 2022-03-28 16:04:19
 * @Description:
-->
<template>
    <div class="page-container">
        <div class="breadcrumb-wrapper">
            <el-breadcrumb separator-class="el-icon-arrow-right">
                <el-breadcrumb-item>注册登录</el-breadcrumb-item>
                <el-breadcrumb-item>隐私政策</el-breadcrumb-item>
            </el-breadcrumb>
        </div>

        <div class="main">
            <p class="main__title">音久音乐隐私政策</p>
            <p class="main__dateTime">生效日期：2020-01-01</p>
            <el-divider></el-divider>
            <div class="main__content">
                <p>在此特别提醒您（用户）在注册成为用户之前，请认真阅读本《用户协议》（以下简称 “协议”），确保您充分理解本协议中各条款。请您审慎阅读并选择接受或不接受本协议。您的注册、登录、使用等行为将视为对本协议的接受，并同意接受本协议各项条款的约束。本协议约定曹氏俊杰科技发展（北京）有限公司及其关联方（以下简称“音久音乐”）与用户之间关于“音久音乐”软件服务（以下简称“服务“）的权利义务。“用户”是指注册、登录、使用本服务的个人。本协议可由音久音乐随时更新，更新后的协议条款一旦公布即代替原来的协议条款，恕不再另行通知，用户可在本APP中查阅最新版协议条款。在修改协议条款后，如果用户不接受修改后的条款，请立即停止使用音久音乐提供的服务，用户继续使用服务将被视为接受修改后的协议。</p>
                <p>我们的产品和服务均适用本隐私政策，请您注意，本隐私政策仅适用于我们所收集的您的个人信息，并不适用于任何第三方对您的个人信息的收集，以及任何第三方提供的 服务或第三方的信息使用规则，我们对任何第三方收集、储存和使用的您个人信息的行为在法律允许的范围内亦不承担任何责任。因此 ，在使用第三方服务时请您留意和仔细阅读第三方向您展示的相关用户协议和隐私政策，并妥善保管和谨慎提供您的个人信息。</p>
                <p>本隐私政策主要向您说明如下信息：</p>
                <p>获取短信识别码权限。</p>
                <p>使用摄像头权限</p>
                <p>读取、写入或删除存储空间权限。</p>
                <p>获取位置权限（百度地图）。</p>
                <p>其他</p>
                <p>一、我们如何收集和使用您的个人信息：</p>
                <p>1.1. 您在使用我们的产品或服务时，我们需要/可能需要收集和使用您的个人信息：对于使用我们产品或服务的核心业务功能所必需的信息，为了保障产品或服务的正常运行，您须授权我们收集和使用；若您拒绝提供，您将无法正常使用我们的产品或服务。对于使用我们产品或服务的附加业务功能可能需要收集的信息，您可以选择是否授权我们收集；若您拒绝提供，将导致附加业务功能无法实现或无法达到我们拟达到的效果，但不影响您对核心业务功能的正常使用。</p>
                <p>1.我们如何收集和使用您的个人信息</p>
                <p>1.1. 您在使用我们的产品或服务时，我们需要/可能需要收集和使用您的个人信息：对于使用我们产品或服务的核心业务功能所必需的信息，为了保障产品或服务的正常运行，您须授权我们收集和使用；若您拒绝提供，您将无法正常使用我们的产品或服务。对于使用我们产品或服务的附加业务功能可能需要收集的信息，您可以选择是否授权我们收集；若您拒绝提供，将导致附加业务功能无法实现或无法达到我们拟达到的效果，但不影响您对核心业务功能的正常使用。</p>
                <p>1.2. 您需授权我们收集和使用您的个人信息的功能：</p>
                <p>1.2.1. 账号注册/登录功能</p>
                <p>(1) 当您使用账号注册功能时，我们会收集由您主动提供给我们的信息（手机号码、密码）。您的密码将以加密形式进行自动存储、传输、验证，我们不会以明文方式存储、传输、验证您的密码。我们收集这些信息是用以完成注册程序、为您持续稳定提供专属于注册用户的产品或服务，并保护您的账号安全。您应知悉，手机号码和验证码匹配结果属于您的个人敏感信息，我们收集该类信息是为了满足相关法律法规的要求，若您拒绝提供可能导致您无法使用我们的此功能，请您谨慎考虑后再提供。</p>
                <p>(2) 同时，您也可以在注册时或后续使用过程中填写或补充您的昵称、头像、性别、地区、生日、个性签名。这些资料将帮助我们更好地了解您并为您提供更优质的服务。若您未填写或后续删除、变更此类信息的，将会影响我们基于您的用户画像信息提供的您感兴趣的内容、广告，但不会影响注册/登录功能的正常使用。</p>
                <p>二、账号注册</p>
                <p>1、用户在使用本服务前需要注册一个“音久音乐”账号。“音久音乐”账号应当使用手机号码绑定注册，请用户使用尚未与“音久音乐”账号绑定的手机号码，以及未被服务根据本协议封禁的手机号码注册“音久音乐”账号。服务可以根据用户需求或产品需要对账号注册和绑定的方式进行变更，而无须事先通知用户。</p>
                <p>2、“音久音乐”系基于“音久音乐播放器“的APP产品，用户注册时应当授权音久音乐及使用其个人信息方可成功注册 “音久音乐”账号。故用户完成注册即表明用户同意服务提取、公开及使用用户的信息。</p>
                <p>3、鉴于“音久音乐”账号的绑定注册方式，您同意服务在注册时将允许您的手机号码及手机设备识别码等信息用于注册。</p>
                <p>4、在用户注册及使用本服务时，音久音乐需要能识别用户身份的个人信息以便服务可以在必要时联系用户，或为用户提供更好的使用体验。音久音乐识别的信息包括但不限于用户的姓名、地址；音久音乐同意对这些信息的使用将受限于第三条用户个人隐私信息保护的约束。</p>
                <p>5、您可以在我们的产品中直接申请注销账户。您可以通过移动端APP访问我的—左上角头像进入设置-注销账号-完成账号注销；您还可以通过PC端在首页点击上方我的头像-注销账号完成账户注销。您注销账户后，我们将停止为您提供产品与/或服务，我们将删除您的个人信息。</p>
                <p>三、用户个人隐私信息保护</p>
                <p>1、如果音久音乐发现或收到他人举报或投诉用户违反本协议约定的，音久音乐有权不经通知随时对相关内容，包括但不限于用户资料、发贴记录进行审查、删除，并视情节轻重对违规账号处以包括但不限于警告、账号封禁、设备封禁、功能封禁的处罚，且通知用户处理结果。</p>
                <p>2、因违反用户协议被封禁的用户，可以自行与音久音乐联系。其中，被实施功能封禁的用户会在封禁期届满后自动恢复被封禁功能。被封禁用户可提交申诉，音久音乐将对申诉进行审查，并自行合理判断决定是否变更处罚措施。</p>
                <p>3、用户理解并同意，音久音乐有权依合理判断对违反有关法律法规或本协议规定的行为进行处罚，对违法违规的任何用户采取适当的法律行动，并依据法律法规保存有关信息向有关部门报告等，用户应承担由此而产生的一切法律责任。</p>
                <p>4、用户理解并同意，因用户违反本协议约定，导致或产生的任何第三方主张的任何索赔、要求或损失，包括合理的律师费，用户应当赔偿音久音乐与合作公司、关联公司，并使之免受损害。</p>
                <p>四、用户发布内容规范</p>
            </div>
        </div>
    </div>
</template>

<script>
export default {
    name: "privacy-policy"
}
</script>

<style lang="scss" scoped>
.page-container {
    .breadcrumb-wrapper {
        height: 60px;
        display: flex;
        align-items: center;
        .el-breadcrumb {
            margin-left: 175px;
        }
    }

    .main {
        padding: 0 259px;
        background: #FFFFFF;
        .main__title {
            margin: 0;
            padding-top: 41px;
            font-size: 2.35rem;
            text-align: center;
        }
        .main__dateTime {
            margin: 20px 0 23px 0;
            font-size: 1.5rem;
            color: #B4B4B4;
            text-align: center;
        }
        .main__content {
            padding-top: 15px;
            :nth-child(n) {
                font-size: 1.5rem;
                color: #403F3F;
            }
            >p:nth-last-child(1) {
                padding-bottom: 200px;
                margin-bottom: 0;
            }
        }
    }
}
</style>